/* Обновляем статусы транзакций из двух CSV-файлов.
   Сформировано 27-04-2025 */

------------------------------------------------------------------
-- Новые статусы: 34767475-7a02-4142-9007-531e58919bbb (пример)
------------------------------------------------------------------
UPDATE "transaction"
SET    status_id = '34767475-7a02-4142-9007-531e58919bbb'
WHERE  id IN (
  '360bb1b5-ac95-48f9-9b4c-db9746a67a17',
  '3e19e634-eae9-4089-92d3-f8f371494e5f',
  '3587e5f7-389d-418e-99a9-aa1a98f51cfa',
  '38619195-5e13-4546-9a2b-88b70a23ad89',
  '3938959b-b278-4409-9718-fe2b4fbbc5be',
  '39ecf70d-3c2d-4a0a-87bb-46e8a5a3e3a7',
  '3664e192-8a5f-4c06-a7a8-db3b073ced70',
  '3c5408f2-a12a-46b0-8a71-2d8d5ce9fa07',
  '3a93dde4-1411-4225-8f73-06ff61d4f762',
  '36d694d8-1d6d-45e7-9d8b-1769e0d28e1e',
  '34b015dc-3f3e-4c19-8f0d-90180b728ca9',
  '33396f8e-9521-4703-a4b7-0bcd27e7aafb',
  '32bde0e3-26f5-4e4c-99cf-04a70e11ef44',
  '33c3b917-8e8a-4da5-8eac-412c71fe7638',
  '331a3a0d-eab7-4f79-a19f-cea2df96e40f',
  '30d09cb3-8b77-4e18-9052-4fa10a2073cb',
  '32dac5f7-7c82-41d2-b382-5271e357b46c',
  '3ef8c1fc-78f1-4b80-a508-94e63d212647',
  '32e2c0f5-1c55-4d88-baf3-52ea02c78b8f',
  '3b7f1d7a-19e0-4582-af55-8b554b16d517',
  '390dca70-397f-4c49-ae22-7aceecd93720',
  '398928c1-3e5a-4e55-8c11-8ac1b3fa79f5'
);

------------------------------------------------------------------
-- Новые статусы: a74979a5-5ff7-4c98-a273-7bf5915ec4cd (пример)
------------------------------------------------------------------
UPDATE "transaction"
SET    status_id = 'a74979a5-5ff7-4c98-a273-7bf5915ec4cd'
WHERE  id IN (
  '0c7d85ba-ef5c-431e-af0d-e260cb1047e2',
  '53efb023-e663-4e39-a334-95b30d9bd6d7',
  '6781c1b4-7ac0-4017-802b-bfa25cf25b18',
  '5d3e4941-7b52-4f48-9dfb-ab8ec60c32a9',
  '5c3a51c1-2db1-44c1-a246-c8afb05882a2',
  '0db89ea8-7f25-41ab-9eb9-872a4fb32700',
  '0fa45837-38a6-4d4d-965b-5e5983d5a7fa',
  '08b880e5-f64f-437b-9d42-4962064c13b4',
  '04f7e60f-a53d-4e62-9944-2142ad918438',
  '04c4441e-7bc6-4f49-8d97-3df2d0fc6639',
  '04dfe117-27d4-4e1c-9ad9-453aace0e72c',
  '047f9323-f2a2-4e31-8848-29e7cd2c0a0e',
  '0420fd26-1d5b-4634-820f-f5dd1d1a1860',
  '08f8dd07-0f4a-45ef-af28-e9a2d8c7b62c',
  '0384f6e9-ffea-4da2-90ae-3a2e6b06276c',
  '03495d2e-9efd-49da-8558-68d60c32584d'
);
